БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностей/ВедомостьОСистемеАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОСистемеАкадемическихЗадолженностей</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатЗаседанияКомиссии</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтроля</name>
      <type>
        <types>EnumRef.НаименованиеКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>EnumRef.Оценка</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкадемическойЗадолженности</name>
      <type>
        <types>EnumRef.НаименованиеСтатуса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностей/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВедомостьОСистемеАкадемическихЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Дата,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Номер,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Преподаватель,
	|	ВедомостьОСистемеАкадемическихЗадолженностей.РезультатЗаседанияКомиссии.(
	|		НомерСтроки,
	|		Группа,
	|		Студент,
	|		ВидКонтроля,
	|		Дисциплина,
	|		Оценка,
	|		СтатусАкадемическойЗадолженности
	|	)
	|ИЗ
	|	Документ.ВедомостьОСистемеАкадемическихЗадолженностей КАК ВедомостьОСистемеАкадемическихЗадолженностей
	|ГДЕ
	|	ВедомостьОСистемеАкадемическихЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРезультатЗаседанияКомиссииШапка = Макет.ПолучитьОбласть("РезультатЗаседанияКомиссииШапка");
	ОбластьРезультатЗаседанияКомиссии = Макет.ПолучитьОбласть("РезультатЗаседанияКомиссии");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРезультатЗаседанияКомиссииШапка);
		ВыборкаРезультатЗаседанияКомиссии = Выборка.РезультатЗаседанияКомиссии.Выбрать();
		Пока ВыборкаРезультатЗаседанияКомиссии.Следующий() Цикл
			ОбластьРезультатЗаседанияКомиссии.Параметры.Заполнить(ВыборкаРезультатЗаседанияКомиссии);
			ТабДок.Вывести(ОбластьРезультатЗаседанияКомиссии, ВыборкаРезультатЗаседанияКомиссии.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
